__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 150, 300)     2011800     input_3[0][0]                    
__________________________________________________________________________________________________
embedding_4 (Embedding)         (None, 150, 300)     984300      input_4[0][0]                    
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 150, 50)      0                                            
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 150, 300)     2995500     input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 150, 600)     0           embedding_3[0][0]                
                                                                 embedding_4[0][0]                
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 50, 25)  1150        input_5[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 150, 900)     0           embedding_2[0][0]                
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 150, 300)     13500       input_1[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 50)      10200       time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 150, 1250)    0           concatenate_2[0][0]              
                                                                 embedding_1[0][0]                
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 150, 300)     1681200     concatenate_3[0][0]              
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 150, 10)      3130        bidirectional_2[0][0]            
==================================================================================================
Total params: 7,700,780
Trainable params: 4,705,280
Non-trainable params: 2,995,500
__________________________________________________________________________________________________
