__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 150, 50)      0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 50, 50)  2300        input_2[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 150, 100)     998500      input_1[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 50)      15200       time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 150, 150)     0           embedding_1[0][0]                
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 150, 150)     0           concatenate_1[0][0]              
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 150, 200)     200800      dropout_1[0][0]                  
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 50)      10050       bidirectional_2[0][0]            
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 150, 10)      630         time_distributed_3[0][0]         
==================================================================================================
Total params: 1,227,480
Trainable params: 228,980
Non-trainable params: 998,500
__________________________________________________________________________________________________
