__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            (None, 75, 50)       0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 75, 50, 25)   2125        input_5[0][0]                    
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
embedding_4 (Embedding)         (None, 75, 300)      2998500     input_4[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 75, 50)       10200       time_distributed_1[0][0]         
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 75, 300)      2100        input_3[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 75, 300)      13500       input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 75, 950)      0           embedding_4[0][0]                
                                                                 time_distributed_2[0][0]         
                                                                 embedding_3[0][0]                
                                                                 embedding_2[0][0]                
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 75, 160)      659840      concatenate_1[0][0]              
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 75, 160)      25760       bidirectional_2[0][0]            
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 75, 10)       1610        time_distributed_3[0][0]         
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 75, 10)       230         time_distributed_4[0][0]         
==================================================================================================
Total params: 3,713,865
Trainable params: 715,365
Non-trainable params: 2,998,500
__________________________________________________________________________________________________
