__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 150, 50)      0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 150, 100)     670600      input_1[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 150, 100)     328100      input_2[0][0]                    
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 50, 25)  2125        input_3[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 150, 200)     0           embedding_1[0][0]                
                                                                 embedding_2[0][0]                
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 50)      10200       time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 150, 250)     0           concatenate_1[0][0]              
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 150, 250)     0           concatenate_2[0][0]              
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 150, 200)     280800      spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 100)     20100       bidirectional_2[0][0]            
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 150, 10)      1130        time_distributed_3[0][0]         
==================================================================================================
Total params: 1,313,055
Trainable params: 1,313,055
Non-trainable params: 0
__________________________________________________________________________________________________
