__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 75, 50)       0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 75, 50, 25)   1150        input_3[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 75, 300)      2995500     input_2[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 75, 300)      1500        input_1[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 75, 50)       10200       time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 75, 650)      0           embedding_2[0][0]                
                                                                 embedding_1[0][0]                
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 75, 650)      0           concatenate_1[0][0]              
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 75, 200)      600800      spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 75, 10)       2130        bidirectional_2[0][0]            
==================================================================================================
Total params: 3,611,280
Trainable params: 615,780
Non-trainable params: 2,995,500
__________________________________________________________________________________________________
