__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 150, 50)      0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 50, 50)  4250        input_2[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 150, 300)     2995500     input_1[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 50)      20200       time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 150, 350)     0           embedding_1[0][0]                
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 150, 350)     0           concatenate_1[0][0]              
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 150, 300)     601200      spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 50)      15050       bidirectional_1[0][0]            
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 150, 10)      630         time_distributed_3[0][0]         
==================================================================================================
Total params: 3,636,830
Trainable params: 3,636,830
Non-trainable params: 0
__________________________________________________________________________________________________
