__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 75, 300)      2998500     input_2[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 75, 300)      1500        input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 75, 600)      0           embedding_2[0][0]                
                                                                 embedding_1[0][0]                
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 75, 200)      560800      concatenate_1[0][0]              
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 75, 50)       10050       bidirectional_1[0][0]            
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 75, 10)       630         time_distributed_1[0][0]         
==================================================================================================
Total params: 3,571,480
Trainable params: 572,980
Non-trainable params: 2,998,500
__________________________________________________________________________________________________
