__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 150, 100)     998500      input_3[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 150, 100)     4500        input_2[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 150, 100)     600         input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 150, 300)     0           embedding_3[0][0]                
                                                                 embedding_2[0][0]                
                                                                 embedding_1[0][0]                
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 150, 300)     0           concatenate_1[0][0]              
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 150, 128)     186880      dropout_1[0][0]                  
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 100)     12900       bidirectional_1[0][0]            
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 150, 10)      1130        time_distributed_1[0][0]         
==================================================================================================
Total params: 1,204,510
Trainable params: 206,010
Non-trainable params: 998,500
__________________________________________________________________________________________________
