__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 75, 50)       0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 75, 50, 10)   460         input_4[0][0]                    
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 75, 20)       199700      input_3[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 75, 20)       900         input_2[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 75, 20)       100         input_1[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 75, 40)       4960        time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 75, 100)      0           embedding_3[0][0]                
                                                                 embedding_2[0][0]                
                                                                 embedding_1[0][0]                
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 75, 100)      0           concatenate_1[0][0]              
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 75, 100)      60400       spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 75, 20)       2020        bidirectional_2[0][0]            
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 75, 10)       330         time_distributed_3[0][0]         
==================================================================================================
Total params: 268,870
Trainable params: 268,870
Non-trainable params: 0
__________________________________________________________________________________________________
