__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 75, 50)       0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 75, 50, 25)   1150        input_4[0][0]                    
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 75, 300)      2998500     input_3[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 75, 100)      30400       time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 75, 400)      0           embedding_3[0][0]                
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 75, 150)      285600      concatenate_1[0][0]              
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 75, 10)       1630        bidirectional_2[0][0]            
==================================================================================================
Total params: 3,317,280
Trainable params: 318,780
Non-trainable params: 2,998,500
__________________________________________________________________________________________________
