__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_8 (InputLayer)            (None, 150, 50)      0                                            
__________________________________________________________________________________________________
input_7 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_6 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 50, 25)  1150        input_8[0][0]                    
__________________________________________________________________________________________________
embedding_7 (Embedding)         (None, 150, 300)     2995500     input_7[0][0]                    
__________________________________________________________________________________________________
embedding_6 (Embedding)         (None, 150, 300)     13500       input_6[0][0]                    
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 150, 50)      10200       time_distributed_3[0][0]         
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 150, 650)     0           embedding_7[0][0]                
                                                                 embedding_6[0][0]                
                                                                 time_distributed_4[0][0]         
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) (None, 150, 300)     961200      concatenate_4[0][0]              
__________________________________________________________________________________________________
crf_2 (CRF)                     (None, 150, 10)      3130        bidirectional_4[0][0]            
==================================================================================================
Total params: 3,984,680
Trainable params: 989,180
Non-trainable params: 2,995,500
__________________________________________________________________________________________________
