__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_11 (InputLayer)           (None, 150, 50)      0                                            
__________________________________________________________________________________________________
input_10 (InputLayer)           (None, 150)          0                                            
__________________________________________________________________________________________________
input_9 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 150, 50, 25)  1150        input_11[0][0]                   
__________________________________________________________________________________________________
embedding_10 (Embedding)        (None, 150, 300)     2995500     input_10[0][0]                   
__________________________________________________________________________________________________
embedding_9 (Embedding)         (None, 150, 300)     13500       input_9[0][0]                    
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, 150, 50)      10200       time_distributed_5[0][0]         
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 150, 650)     0           embedding_10[0][0]               
                                                                 embedding_9[0][0]                
                                                                 time_distributed_6[0][0]         
__________________________________________________________________________________________________
bidirectional_6 (Bidirectional) (None, 150, 300)     961200      concatenate_5[0][0]              
__________________________________________________________________________________________________
crf_3 (CRF)                     (None, 150, 10)      3130        bidirectional_6[0][0]            
==================================================================================================
Total params: 3,984,680
Trainable params: 3,984,680
Non-trainable params: 0
__________________________________________________________________________________________________
