__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            (None, 75, 50)       0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 75)           0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 75, 50, 25)   2125        input_5[0][0]                    
__________________________________________________________________________________________________
embedding_4 (Embedding)         (None, 75, 300)      2998500     input_4[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 75, 50)       10200       time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 75, 350)      0           embedding_4[0][0]                
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 75, 350)      0           concatenate_1[0][0]              
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 75, 200)      360800      dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 75, 200)      0           bidirectional_2[0][0]            
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 75, 10)       2130        dropout_2[0][0]                  
==================================================================================================
Total params: 3,373,755
Trainable params: 375,255
Non-trainable params: 2,998,500
__________________________________________________________________________________________________
