__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 150, 50)      0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 50, 25)  1150        input_3[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 150, 100)     998500      input_2[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 150, 45)      449325      input_1[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 100)     30400       time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 150, 245)     0           embedding_2[0][0]                
                                                                 embedding_1[0][0]                
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 150, 245)     0           concatenate_1[0][0]              
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 150, 128)     158720      dropout_1[0][0]                  
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 100)     12900       bidirectional_2[0][0]            
__________________________________________________________________________________________________
crf_1 (CRF)                     (None, 150, 10)      1130        time_distributed_3[0][0]         
==================================================================================================
Total params: 1,652,125
Trainable params: 1,652,125
Non-trainable params: 0
__________________________________________________________________________________________________
