Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            (None, 150, 50)      0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 150)          0                                            
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 50, 25)  1150        input_6[0][0]                    
__________________________________________________________________________________________________
embedding_5 (Embedding)         (None, 150, 200)     1997000     input_5[0][0]                    
__________________________________________________________________________________________________
embedding_4 (Embedding)         (None, 150, 200)     9000        input_4[0][0]                    
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 150, 50)      10200       time_distributed_3[0][0]         
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 150, 450)     0           embedding_5[0][0]                
                                                                 embedding_4[0][0]                
                                                                 time_distributed_4[0][0]         
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) (None, 150, 200)     440800      concatenate_2[0][0]              
__________________________________________________________________________________________________
crf_2 (CRF)                     (None, 150, 10)      2130        bidirectional_4[0][0]            
==================================================================================================
Total params: 2,460,280
Trainable params: 463,280
Non-trainable params: 1,997,000
__________________________________________________________________________________________________
